---
kind: type
id: T:Autodesk.Revit.DB.ComponentRepeaterIterator
source: html/d2bc2d9c-ae40-4e5e-a56a-9e5e8e7057cf.htm
---
# Autodesk.Revit.DB.ComponentRepeaterIterator

A slot iterator for ComponentRepeater.

## Syntax (C#)
```csharp
public class ComponentRepeaterIterator : IEnumerator<ComponentRepeaterSlot>
```